# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3 
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()
import pandas as pd

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [4]:
#Your code here; use a subquery. No join will be necessary.
c.execute("""select customerNumber, contactLastName, contactFirstName 
             from customers
             where customerNumber in (select customerNumber
                                   from orders
                                   where orderDate = '2003-01-31');""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [5]:
#Your code here
# c.execute("""select productName, quantityOrdered
#              from products
#              where productCode in (select productCode
#                                      from orderdetails
#                                      join products
#                                      using (productcode)
#                                      order by quantityOrdered desc);""")
c.execute("""select productName, quantityOrdered
             from products
             join orderdetails
             using (productCode)
             order by quantityOrdered desc""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

                                productName quantityOrdered
0                        1969 Dodge Charger              97
1                      1969 Dodge Super Bee              90
2            America West Airlines B757-200              85
3                   1970 Plymouth Hemi Cuda              77
4                        F/A 18 Hornet 1/72              77
5                  1917 Grand Touring Sedan              76
6                        1949 Jaguar XK 120              76
7                   1956 Porsche 356A Coupe              76
8                  1962 Volkswagen Microbus              70
9                   1956 Porsche 356A Coupe              70
10    1969 Harley Davidson Ultimate Chopper              66
11     2003 Harley-Davidson Eagle Drag Bike              66
12                         2002 Suzuki XREO              66
13      1932 Alfa Romeo 8C2300 Spider Sport              66
14                    1957 Ford Thunderbird              66
15                     1937 Lincoln Berline              65
16           1948 Porsche Type 356 Roadster              65
17                      1972 Alfa Romeo GTA              64
18                        1968 Ford Mustang              64
19                1966 Shelby Cobra 427 S/C              64
20                 Corsair F4U ( Bird Cage)              64
21                 1928 Ford Phaeton Deluxe              62
22                          1993 Mazda RX-7              61
23              1948 Porsche 356-A Roadster              61
24              1939 Chevrolet Deluxe Coupe              61
25              1992 Ferrari 360 Spider red              60
26               1970 Chevy Chevelle SS 454              60
27         1912 Ford Model T Delivery Wagon              60
28                1932 Model A Ford J-Coupe               6
29      1932 Alfa Romeo 8C2300 Spider Sport               6
...                                     ...             ...
2966           1930 Buick Marquette Phaeton              20
2967         1962 City of Detroit Streetcar              20
2968                     2002 Yamaha YZR M1              20
2969                     2002 Yamaha YZR M1              20
2970            American Airlines: B767-300              20
2971                          The Mayflower              20
2972                             HMS Bounty              20
2973         America West Airlines B757-200              20
2974                        1982 Camaro Z28              20
2975                          ATA: B757-300              20
2976                         The Queen Mary              20
2977                       Boeing X-32A JSF              20
2978                             Pont Yacht              20
2979                  1926 Ford Fire Engine              19
2980            1954 Greyhound Scenicruiser              19
2981              1937 Horch 930V Limousine              18
2982               Corsair F4U ( Bird Cage)              18
2983       Diamond T620 Semi-Skirted Tanker              18
2984                   1969 Dodge Super Bee              16
2985                         P-51-D Mustang              15
2986                1982 Lamborghini Diablo              15
2987       1936 Mercedes Benz 500k Roadster              15
2988       1936 Mercedes Benz 500k Roadster              15
2989              1969 Chevrolet Camaro Z28              13
2990                      1968 Ford Mustang              12
2991            1954 Greyhound Scenicruiser              11
2992            American Airlines: B767-300              11
2993                     1968 Dodge Charger              10
2994            1913 Ford Model T Speedster              10
2995                  1961 Chevrolet Impala              10

[2996 rows x 2 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [6]:
c.execute("""select productName,
                    count(distinct customerNumber) numPurchasers
                    from products
                    join orderdetails
                    using(productCode)
                    join orders
                    using (orderNumber)
                    group by productname
                    order by numPurchasers desc;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

                   productName  numPurchasers
0  1992 Ferrari 360 Spider red             40
1           1934 Ford V8 Coupe             27
2     1952 Alpine Renault 1300             27
3          1972 Alfa Romeo GTA             27
4             Boeing X-32A JSF             27

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [7]:
c.execute("""select distinct employeeNumber,
                    officeCode,
                    o.city,
                    firstName,
                    lastName
                    from employees e
                    join offices o
                    using(officeCode)
                    join customers c
                    on e.employeeNumber = c.salesRepEmployeeNumber
                    join orders
                    using (customerNumber)
                    join orderdetails
                    using (orderNumber)
                    where productCode in (select productCode
                                                 from products
                                                 join orderdetails
                                                 using (productCode)
                                                 join orders
                                                 using (orderNumber)
                                                 group by productcode
                                                 having count(distinct customerNumber) <= 20
            );""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   employeeNumber officeCode           city firstName   lastName
0            1370          4          Paris    Gerard  Hernandez
1            1401          4          Paris    Pamela   Castillo
2            1621          5          Tokyo      Mami      Nishi
3            1501          7         London     Larry       Bott
4            1337          4          Paris      Loui     Bondur
5            1286          3            NYC  Foon Yue      Tseng
6            1166          1  San Francisco    Leslie   Thompson
7            1165          1  San Francisco    Leslie   Jennings
8            1612          6         Sydney     Peter      Marsh
9            1188          2         Boston     Julie   Firrelli
10           1611          6         Sydney      Andy     Fixter
11           1323          3            NYC    George     Vanauf
12           1702          4          Paris    Martin     Gerard
13           1504          7         London     Barry      Jones
14           1216          2         Boston     Steve  Patterson

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [13]:
#Your code here
# c.execute()
c.execute(""" SELECT employeeNumber, firstName, lastName, count(customerNumber)
              FROM employees e
              JOIN customers c
              ON e.employeeNumber = c.salesRepEmployeeNumber
              GROUP BY employeeNumber
              HAVING employeeNumber IN
                        (SELECT employeeNumber 
                         From employees e
                         JOIN customers c
                         ON e.employeeNumber = c.salesRepEmployeeNumber
                         GROUP BY employeeNumber
                         HAVING AVG(creditlimit) > 15000)""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   employeeNumber firstName   lastName  count(customerNumber)
0            1165    Leslie   Jennings                      6
1            1166    Leslie   Thompson                      6
2            1188     Julie   Firrelli                      6
3            1216     Steve  Patterson                      6
4            1286  Foon Yue      Tseng                      7
5            1323    George     Vanauf                      8
6            1337      Loui     Bondur                      6
7            1370    Gerard  Hernandez                      7
8            1401    Pamela   Castillo                     10
9            1501     Larry       Bott                      8
10           1504     Barry      Jones                      9
11           1611      Andy     Fixter                      5
12           1612     Peter      Marsh                      5
13           1621      Mami      Nishi                      5
14           1702    Martin     Gerard                      6

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!